<?php

//print_r($contentPage->content);

$arr_izdeliya = $contentPage->total_izdeliya;
$total_kromka = 0;
$total_ldsp = 0;
$total_dvpo = 0;
$total_fasad = 0;
$total_price = 0;
$total_dlina = 0;

for($i=0;$i<count($arr_izdeliya);$i++) {
	
	print_r($arr_izdeliya[$i]);
	echo '<br><br>
			';
	$total_kromka += $arr_izdeliya[$i]['dlina_kromki'];
	$total_ldsp += $arr_izdeliya[$i]['volume_dsp'];
	$total_dvpo += $arr_izdeliya[$i]['volume_dvpo'];
	$total_fasad += $arr_izdeliya[$i]['volume_fasad'];
	$total_price += $arr_izdeliya[$i]['total_price'];
	$total_dlina += $arr_izdeliya[$i]['dlina'];
}
echo 'Длина кромки: '.$total_kromka.' м., Площадь ЛДСП: '.$total_ldsp.' м2, Площадь ДВП: '.$total_dvpo.' м2, Площадь фасадов: '.$total_fasad.' м2<br>
		<strong>Стоимость: '.$total_price.' рублей за кухню длиной '.$total_dlina.' м.</strong> без столешницы';






/*
$arr = array("CCC58F","RAL_1000","Зелёно-бежевый","D1BC8A","RAL_1001","Бежевый","D2B773","RAL_1002","Песочно-жёлтый","F7BA0B","RAL_1003","Сигнальный жёлтый","E2B007","RAL_1004","Жёлто-золотой","C89F04","RAL_1005","Медово-жёлтый","E1A100","RAL_1006","Кукурузно-жёлтый","E79C00","RAL_1007","Нарциссово-жёлтый","AF8A54","RAL_1011","Коричнево-бежевый","D9C022","RAL_1012","Лимонно-жёлтый","E9E5CE","RAL_1013","Жемчужно-белый","DED09F","RAL_1014","Слоновая кость","EADEBD","RAL_1015","Светлая слоновая кость","EAF044","RAL_1016","Жёлтая сера","F4B752","RAL_1017","Шафраново-жёлтый","F3E03B","RAL_1018","Цинково-жёлтый","A4957D","RAL_1019","Серо-бежевый","9A9464","RAL_1020","Оливково-жёлтый","EEC900","RAL_1021","Рапсово-жёлтый","F0CA00","RAL_1023","Транспортно-жёлтый","B89C50","RAL_1024","Охра жёлтая","F5FF00","RAL_1026","Люминесцентный жёлтый","A38C15","RAL_1027","Карри жёлтый","FFAB00","RAL_1028","Дынно-жёлтый","DDB20F","RAL_1032","Жёлтый ракитник","FAAB21","RAL_1033","Георгиново-жёлтый","EDAB56","RAL_1034","Пастельно-жёлтый","A29985","RAL_1035","Перламутрово-бежевый","927549","RAL_1036","Перламутрово-золотой","EEA205","RAL_1037","Солнечно-жёлтый","DD7907","RAL_2000","Жёлто-оранжевый","BE4E24","RAL_2001","Красно-оранжевый","C63927","RAL_2002","Алый","FA842B","RAL_2003","Пастельно-оранжевый","E75B12","RAL_2004","Оранжевый","FF2300","RAL_2005","Люминесцентный оранжевый","FFA421","RAL_2007","Люминесцентный ярко-оранжевый","F3752C","RAL_2008","Ярко-красно-оранжевый","E15501","RAL_2009","Транспортный оранжевый","D4652F","RAL_2010","Сигнальный оранжевый","EC7C25","RAL_2011","Насыщенный оранжевый","DB6A50","RAL_2012","Лососёво-оранжевый","954527","RAL_2013","Перламутрово-оранжевый","AB2524","RAL_3000","Огненно-красный","A02128","RAL_3001","Сигнальный красный","A1232B","RAL_3002","Карминно-красный","8D1D2C","RAL_3003","Рубиново-красный","701F29","RAL_3004","Пурпурно-красный","5E2028","RAL_3005","Винно-красный","402225","RAL_3007","Чёрно-красный","703731","RAL_3009","Оксид красный","7E292C","RAL_3011","Коричнево-красный","CB8D73","RAL_3012","Бежево-красный","9C322E","RAL_3013","Томатно-красный","D47479","RAL_3014","Розовый антик","E1A6AD","RAL_3015","Светло-розовый","AC4034","RAL_3016","Кораллово-красный","D3545F","RAL_3017","Розовый","D14152","RAL_3018","Клубнично-красный","C1121C","RAL_3020","Транспортный красный","D56D56","RAL_3022","Лососёво-красный","F70000","RAL_3024","Люминесцентный красный","FF0000","RAL_3026","Люминесцентный ярко-красный","B42041","RAL_3027","Малиново-красный","CB3334","RAL_3028","Красный","AC323B","RAL_3031","Ориент красный","711521","RAL_3032","Перламутрово-рубиновый","B24C43","RAL_3033","Перламутрово-розовый","8A5A83","RAL_4001","Красно-сиреневый","933D50","RAL_4002","Красно-фиолетовый","D15B8F","RAL_4003","Вересково-фиолетовый","691639","RAL_4004","Бордово-фиолетовый","83639D","RAL_4005","Сине-сиреневый","992572","RAL_4006","Транспортный пурпурный","4A203B","RAL_4007","Пурпурно-фиолетовый","904684","RAL_4008","Сигнальный фиолетовый","A38995","RAL_4009","Пастельно-фиолетовый","C63678","RAL_4010","Телемагента","8773A1","RAL_4011","Перламутрово-фиолетовый","6B6880","RAL_4012","Перламутрово-ежевичный","384C70","RAL_5000","Фиолетово-синий","1F4764","RAL_5001","Зелёно-синий","2B2C7C","RAL_5002","Ультрамариново-синий","2A3756","RAL_5003","Сапфирово-синий","1D1F2A","RAL_5004","Чёрно-синий","154889","RAL_5005","Сигнальный синий","41678D","RAL_5007","Бриллиантово-синий","313C48","RAL_5008","Серо-синий","2E5978","RAL_5009","Лазурно-синий","13447C","RAL_5010","Горечавково-синий","232C3F","RAL_5011","Стально-синий","3481B8","RAL_5012","Голубой","232D53","RAL_5013","Кобальтово-синий","6C7C98","RAL_5014","Голубино-синий","2874B2","RAL_5015","Небесно-синий","0E518D","RAL_5017","Транспортный синий","21888F","RAL_5018","Бирюзово-синий","1A5784","RAL_5019","Капри синий","0B4151","RAL_5020","Океанская синь","07737A","RAL_5021","Водная синь","2F2A5A","RAL_5022","Ночной синий","4D668E","RAL_5023","Отдалённо-синий","6A93B0","RAL_5024","Пастельно-синий","296478","RAL_5025","Перламутровый горечавково-синий","102C54","RAL_5026","Перламутровый ночной синий","327662","RAL_6000","Патиново-зелёный","28713E","RAL_6001","Изумрудно-зелёный","276235","RAL_6002","Лиственно-зелёный","4B573E","RAL_6003","Оливково-зелёный","0E4243","RAL_6004","Сине-зелёный","0F4336","RAL_6005","Зелёный мох","40433B","RAL_6006","Серо-оливковый","283424","RAL_6007","Бутылочно-зелёный","35382E","RAL_6008","Коричнево-зелёный","26392F","RAL_6009","Пихтовый зелёный","3E753B","RAL_6010","Травяной зелёный","66825B","RAL_6011","Резедово-зелёный","31403D","RAL_6012","Чёрно-зелёный","797C5A","RAL_6013","Тростниково-зелёный","444337","RAL_6014","Жёлто-оливковый","3D403A","RAL_6015","Чёрно-оливковый","026A52","RAL_6016","Бирюзово-зелёный","468641","RAL_6017","Майский зелёный","48A43F","RAL_6018","Желто-зелёный","B7D9B1","RAL_6019","Бело-зелёный","354733","RAL_6020","Хромовый зелёный","86A47C","RAL_6021","Бледно-зелёный","3E3C32","RAL_6022","Коричнево-оливковый","008754","RAL_6024","Транспортный зелёный","53753C","RAL_6025","Папоротниково-зелёный","005D52","RAL_6026","Опаловый зелёный","81C0BB","RAL_6027","Светло-зелёный","2D5546","RAL_6028","Сосновый зелёный","007243","RAL_6029","Мятно-зелёный","0F8558","RAL_6032","Сигнальный зелёный","478A84","RAL_6033","Мятно-бирюзовый","7FB0B2","RAL_6034","Пастельно-бирюзовый","1B542C","RAL_6035","Перламутрово-зелёный","005D4C","RAL_6036","Перламутровый опаловый зелёный","008F39","RAL_6037","Зелёный","00BB2E","RAL_6038","Люминесцентный зелёный","7E8B92","RAL_7000","Серая белка","8F999F","RAL_7001","Серебристо-серый","817F68","RAL_7002","Оливково-серый","7A7B6D","RAL_7003","Серый мох","9EA0A1","RAL_7004","Сигнальный серый","6B716F","RAL_7005","Мышино-серый","756F61","RAL_7006","Бежево-серый","746643","RAL_7008","Серое хаки","5B6259","RAL_7009","Зелёно-серый","575D57","RAL_7010","Брезентово-серый","555D61","RAL_7011","Железно-серый","596163","RAL_7012","Базальтово-серый","555548","RAL_7013","Коричнево-серый","51565C","RAL_7015","Сланцево-серый","373F43","RAL_7016","Антрацитово-серый","2E3234","RAL_7021","Чёрно-серый","4B4D46","RAL_7022","Серая умбра","818479","RAL_7023","Серый бетон","474A50","RAL_7024","Графитовый серый","374447","RAL_7026","Гранитовый серый","939388","RAL_7030","Каменно-серый","5D6970","RAL_7031","Сине-серый","B9B9A8","RAL_7032","Галечный серый","818979","RAL_7033","Цементно-серый","939176","RAL_7034","Жёлто-серый","CBD0CC","RAL_7035","Светло-серый","9A9697","RAL_7036","Платиново-серый","7C7F7E","RAL_7037","Пыльно-серый","B4B8B0","RAL_7038","Агатовый серый","6B695F","RAL_7039","Кварцевый серый","9DA3A6","RAL_7040","Серое окно","8F9695","RAL_7042","Транспортный серый A","4E5451","RAL_7043","Транспортный серый B","BDBDB2","RAL_7044","Серый шёлк","91969A","RAL_7045","Телегрей 1","82898E","RAL_7046","Телегрей 2","CFD0CF","RAL_7047","Телегрей 4","888175","RAL_7048","Перламутровый мышино-серый","887142","RAL_8000","Зелёно-коричневый","9C6B30","RAL_8001","Охра коричневая","7B5141","RAL_8002","Сигнальный коричневый","80542F","RAL_8003","Глиняный коричневый","8F4E35","RAL_8004","Медно-коричневый","6F4A2F","RAL_8007","Олень коричневый","6F4F28","RAL_8008","Оливково-коричневый","5A3A29","RAL_8011","Орехово-коричневый","673831","RAL_8012","Красно-коричневый","49392D","RAL_8014","Сепия коричневый","633A34","RAL_8015","Каштаново-коричневый","4C2F26","RAL_8016","Махагон коричневый","44322D","RAL_8017","Шоколадно-коричневый","3F3A3A","RAL_8019","Серо-коричневый","211F20","RAL_8022","Чёрно-коричневый","A65E2F","RAL_8023","Оранжево-коричневый","79553C","RAL_8024","Бежево-коричневый","755C49","RAL_8025","Бледно-коричневый","4E3B2B","RAL_8028","Терракотовый","773C27","RAL_8029","Перламутровый медный","EFEBDC","RAL_9001","Кремово-белый","DDDED4","RAL_9002","Светло-серый","F4F8F4","RAL_9003","Сигнальный белый","2E3032","RAL_9004","Сигнальный чёрный","0A0A0D","RAL_9005","Чёрный янтарь","A5A8A6","RAL_9006","Бело-алюминиевый","8F8F8C","RAL_9007","Тёмно-алюминиевый","F7F9EF","RAL_9010","Белый","292C2F","RAL_9011","Графитно-чёрный","F7FBF5","RAL_9016","Транспортный белый","2A2D2F","RAL_9017","Транспортный чёрный","CFD3CD","RAL_9018","Папирусно-белый","9C9C9C","RAL_9022","Перламутровый светло-серый","7E8182","RAL_9023","Перламутровый тёмно-серый");
for($i = 0; $i < count($arr); $i = $i + 3) {
	$colors = hex2rgb('#'.$arr[$i]);
	$im = ImageCreate (1000, 1500);  
	$couleur_fond = ImageColorAllocate ($im, $colors['red'], $colors['green'], $colors['blue']);
	$image_name = Engine::Translit($arr[$i+2].' ('.$arr[$i+1].')');
	ImageJpeg ($im, $_SERVER[DOCUMENT_ROOT].'/'.Engine::$settings['directory_pictures'].'/'.$image_name.'.jpg');
	$data['pic_url'] = $image_name.'.jpg';
	$data['active'] = 1;
	$data['title'] = $arr[$i+2].' ('.$arr[$i+1].')';
	$data['url'] = 'brushed_fasad_'.$image_name;
	$data['content'] = "";
	$data['category'] = 137;
	$data['price'] = 6000;
	$data['price_zakup'] = 6000;
	$data['quantity'] = 100;
	$data['weight'] = 0;
	$data['lenght'] = 0;
	$data['prop'] = "";
	$data['country'] = 1;
	dBShop::newItem($data);
}
function hex2rgb( $colour ) {
	if ( $colour[0] == '#' ) {
		$colour = substr( $colour, 1 );
	}
	if ( strlen( $colour ) == 6 ) {
		list( $r, $g, $b ) = array( $colour[0] . $colour[1], $colour[2] . $colour[3], $colour[4] . $colour[5] );
	} elseif ( strlen( $colour ) == 3 ) {
		list( $r, $g, $b ) = array( $colour[0] . $colour[0], $colour[1] . $colour[1], $colour[2] . $colour[2] );
	} else {
		return false;
	}
	$r = hexdec( $r );
	$g = hexdec( $g );
	$b = hexdec( $b );
	return array( 'red' => $r, 'green' => $g, 'blue' => $b );
}
*/

?>